package T0308.OOP;

/**
 * Created by vip on 2018/3/8.
 */
public class OOP {
    /**
     * 三大特性，概念、特性体现、使用场景：
     * 封装：当你使用其他人实现的对象并在对象上调用方法时，不需要知道底层是怎么做的，
     * 继承：
     * 多态：
     */

    /**
     * 静态多分派，动态单分派 概念
     */

    /**
     * 重载的概念和使用
     */

    /**
     * 继承：接口多实现，基类单继承（单继承多实现）
     */

    /**
     * 抽象，抽象类，接口
     */

    /**
     * 多态：方法覆盖的概念和使用
     */

    /**
     * 接口回调
     */

    /*Accessor访问器  Mutator更改器*/
    /*如果一个方法改变了调用它的对象，我们就说这是一个更改器方法，ArrayList类的add方法
    * 如果方法不改变调用自己的对象，它就是访问器方法
    * 修改有风险，并发访问；类只提供访问器方法，使对象都是不可变的*/

    /*java 中，变量只能持有对象的引用*/
}
